app/controllers/hash_tags_controller.rb

  def index
    if current_user && params[:q]
      teams = current_user.hash_tags.where("content LIKE ?", "#{params[:q]}%").pluck(:content)
---
SELECT "hash_tags"."content" FROM "hash_tags" WHERE "hash_tags"."user_id" = ? AND (content LIKE 'dfda%')  [["user_id", 1]]