app/controllers/teams_controller.rb

SELECT "teams"."name" FROM "teams" WHERE "teams"."user_id" = ? AND (name LIKE 'col%')  [["user_id", 1]]
---
  def index
    if current_user && params[:q]
      teams = current_user.teams.where("name LIKE ?", "#{params[:q]}%").pluck(:name)